АлогистикТест2/src/Documents/алк_СменныйРапортОтходы/алк_СменныйРапортОтходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СменныйРапортОтходы</name>
  <registerRecords>AccumulationRegister.алк_СменныйРапорт</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>InformationRegister.алк_ДопАналитикаПакетов</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МастерОтходы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеУпаковка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодУпаковки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертификатFSC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопАналитика</name>
      <type>
        <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперативныеДанныеУпаковка</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодУпаковки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертификатFSC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Производство</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасформированныеПакеты</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторнаяУпаковка</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПередачаНаСГП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратС_СГП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_АналитикаЩепа/алк_АналитикаЩепа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_АналитикаЩепа</name>
  <enumValues>
    <name>Лущение</name>
  </enumValues>
  <enumValues>
    <name>Ребросклей</name>
  </enumValues>
  <enumValues>
    <name>ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводствоВозвратных</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПоддонов</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКотельной</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Утилизация</name>
  </enumValues>
  <enumValues>
    <name>Окорка</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_СменныйРапортОтходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		//	
		//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		//	
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортКратко") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортКратко", "Сменный рапорт работы линии ЦЛП (кратко)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортКратко"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортУпаковка") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортУпаковка", "Упаковано продукции", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортУпаковка"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РапортУпаковка";
		КомандаПечати.Представление = НСтр("ru = 'Сменный рапорт по участку упаковки'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		//
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Идентификатор = "РапортРаспиловка";
		//КомандаПечати.Представление = НСтр("ru = 'Выход по распиловке (расчетный)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		//КомандаПечати.Порядок = 1;
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
		//КомандаПечати.Идентификатор = "ТН";
		//КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 23;
		
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "РапортУпаковка" Тогда
				
				СформироватьРапортУпаковка(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "РапортРаспиловка" Тогда
				
				СформироватьРапортРаспиловка(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()	
	
	// Процедура формирования Железнодорожной спецификации для пиломатериалов
	//
	Процедура СформироватьРапортКратко(ТабличныйДокумент, ТекущийДокумент)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("РапортОбщий");
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		
		// Сортировка
		
		ОбластьРаздел.Параметры.Раздел = "Участок сортировки лесопродукции";
		
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		СКД_Сортировка = ПолучитьМакет("СКД_Сортировка");
		ТД_Сортировка = СформироватьПоСКД(СКД_Сортировка, ТекущийДокумент);
		ТД_Сортировка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Вывести(ТД_Сортировка);
		
		//ДобавитьОтчет(ТабличныйДокумент, ТД_Сортировка);
		
		
		//// Приемка
		
		//ОбластьРаздел.Параметры.Раздел = "Приемка сырья (УСЛМ)";
		//
		//ТабличныйДокумент.Вывести(ОбластьРаздел);
		//
		//СКД_Приемка = ПолучитьМакет("СКД_Приемка");
		//ТД_Приемка = СформироватьПоСКД(СКД_Приемка, ТекущийДокумент);	
		//ТД_Приемка.ОтображатьГруппировки = Истина;
		
		//ДобавитьОтчет(ТабличныйДокумент, ТД_Приемка);
		//		
		
		//ТабличныйДокумент.ОтображатьГруппировки = Истина;
		
	КонецПроцедуры  // СформироватьРапортКратко()	
	
	Процедура СформироватьРапортРаспиловка(ТабличныйДокумент, ТекущийДокумент)
		
		СКД_Распиловка = ПолучитьМакет("СКД_РаспиловкаТеория");
		ТД_Распиловка  = СформироватьПоСКД(СКД_Распиловка, ТекущийДокумент);
		ТД_Распиловка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Вывести(ТД_Распиловка);
		
	КонецПроцедуры
	
	Процедура СформироватьРапортУпаковка(ТабличныйДокумент, ТекущийДокумент)
		
		СКД_Упаковка = ПолучитьМакет("СКД_Упаковка");
		ТД_Упаковка = СформироватьПоСКД(СКД_Упаковка, ТекущийДокумент);
		ТД_Упаковка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Автомасштаб = Истина;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабличныйДокумент.Вывести(ТД_Упаковка);
		
		Макет = Документы.алк_СменныйРапортОтходы.ПолучитьМакет("ПодписиУпаковка");
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.МастерЦЛП = ТекущийДокумент.МастерОтходы;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецПроцедуры

	#КонецОбласти
	
	
	#Область ИнициализацияДаных
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СменныйРапортОтходыДанныеУпаковка.СерийныйНомер,
		|	алк_СменныйРапортОтходыДанныеУпаковка.ДопАналитика КАК Аналитика,
		|	&Период
		|ИЗ
		|	Документ.алк_СменныйРапортОтходы.ДанныеУпаковка КАК алк_СменныйРапортОтходыДанныеУпаковка
		|ГДЕ
		|	алк_СменныйРапортОтходыДанныеУпаковка.Ссылка = &Ссылка
		|	И алк_СменныйРапортОтходыДанныеУпаковка.ДопАналитика <> ЗНАЧЕНИЕ(Перечисление.алк_ДопАналитикаПараметрыПакетовОперативный.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаСменныйРапорт.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСменныйРапорт.Ссылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДопАналитикаПакетов", МассивРезультатов[0].Выгрузить());
		
		//СформироватьТаблицаОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства)
		
		ТаблицаОтходы = Новый ТаблицаЗначений;
		ТаблицаОтходы.Колонки.Добавить("Номенклатура");
		ТаблицаОтходы.Колонки.Добавить("Характеристика");
		ТаблицаОтходы.Колонки.Добавить("ДатаСмены");
		ТаблицаОтходы.Колонки.Добавить("Смена");
		ТаблицаОтходы.Колонки.Добавить("Объем");
		ТаблицаОтходы.Колонки.Добавить("ВидДвижения");
		ТаблицаОтходы.Колонки.Добавить("Период");
		ТаблицаОтходы.Колонки.Добавить("Аналитика");
		
		ОбъемОтходов = ДокументСсылкаСменныйРапорт.Т_Распилено.Итог("Объем") - ДокументСсылкаСменныйРапорт.Т_Выход.Итог("Объем");
		
		НоваяСтрока = ТаблицаОтходы.Добавить();
		НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа);
		НоваяСтрока.Объем = ОбъемОтходов * 0.68;
		
		НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
		
		НоваяСтрока = ТаблицаОтходы.Добавить();
		НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Кора);
		НоваяСтрока.Объем = ОбъемОтходов * 0.08;
		
		НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
		
		НоваяСтрока = ТаблицаОтходы.Добавить();
		НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Опилки);
		НоваяСтрока.Объем = ОбъемОтходов * 0.24;
		
		НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", ТаблицаОтходы);
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	#КонецОбласти 
	
	
	#Область СлужебныеПроцедуры
	
	// ТДПриемник - табличный документ, в кот. устанавливается новый формат
	// Отчет - табличный документ, на основании кот. будет установлен новый формат
	//
	Процедура ДобавитьОтчет(ТДПриемник, Отчет)
		
		НачалоНовогоФорматаСтрок = ТДПриемник.ВысотаТаблицы + 1;
		ОбластьПрямоугольная = Отчет.Область(1, , Отчет.ВысотаТаблицы, );
		ТДПриемник.ВставитьОбласть(ОбластьПрямоугольная, ТДПриемник.Область(НачалоНовогоФорматаСтрок, 1));
		ТДПриемник.Область(НачалоНовогоФорматаСтрок, , 
		НачалоНовогоФорматаСтрок + Отчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		
		Для Счетчик = 1 По Отчет.ШиринаТаблицы Цикл
			ТДПриемник.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = Отчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТДПриемник.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецПроцедуры // ДобавитьОтчет 
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Функция СформироватьПоСКД(СхемаКомпоновкиДанных, Параметры)
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
		Настройки = КомпоновщикНастроек. ПолучитьНастройки();
		
		УстановитьОтбор(Настройки, "Ссылка", Параметры.Ссылка);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		Настройки,
		);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции	 
	
	#КонецОбласти 
	
	
#КонецЕсли
